runs/stateful/full_paper/exp5_throughput_overhead_llama3_vllm/vllm_runs/meta-llama_Meta-Llama-3-8B-Instruct/ctx4096_out128_a8_b4_s0/vllm_bench_raw.txt
INFO 05-05 00:48:28 [scheduler.py:216] Chunked prefill is enabled with max_num_batched_tokens=2048.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x14e69d8551c0>, seed=0, num_prompts=32, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=48000, endpoint='/v1/completions', header=None, max_concurrency=None, model='meta-llama/Meta-Llama-3-8B-Instruct', tokenizer='meta-llama/Meta-Llama-3-8B-Instruct', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-efd6a1fd-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
INFO 05-05 00:48:29 [datasets.py:613] Sampling input_len from [4095, 4095] and output_len from [128, 128]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
Initial test run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     32        
Failed requests:                         0         
Benchmark duration (s):                  7.80      
Total input tokens:                      131040    
Total generated tokens:                  4096      
Request throughput (req/s):              4.10      
Output token throughput (tok/s):         525.35    
Peak output token throughput (tok/s):    1918.00   
Peak concurrent requests:                32.00     
Total Token throughput (tok/s):          17332.56  
---------------Time to First Token----------------
Mean TTFT (ms):                          3179.70   
Median TTFT (ms):                        3140.16   
P99 TTFT (ms):                           6134.83   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          33.88     
Median TPOT (ms):                        34.33     
P99 TPOT (ms):                           53.58     
---------------Inter-token Latency----------------
Mean ITL (ms):                           33.88     
Median ITL (ms):                         14.07     
P99 ITL (ms):                            103.18    
==================================================

/scratch/djy8hg/env/saa_vllm_env/lib/python3.11/site-packages/transformers/utils/hub.py:110: FutureWarning: Using `TRANSFORMERS_CACHE` is deprecated and will be removed in v5 of Transformers. Use `HF_HOME` instead.
  warnings.warn(

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:06 remaining
 |          | 00:01 elapsed, 230:13:23 remaining

  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [00:07<03:39,  7.10s/it]
 16%|█▌        | 5/32 [00:07<00:29,  1.08s/it]
 28%|██▊       | 9/32 [00:07<00:11,  1.99it/s]
 44%|████▍     | 14/32 [00:07<00:04,  3.76it/s]
 59%|█████▉    | 19/32 [00:07<00:02,  6.05it/s]
 75%|███████▌  | 24/32 [00:07<00:00,  8.99it/s]
 94%|█████████▍| 30/32 [00:07<00:00, 13.37it/s]
100%|██████████| 32/32 [00:07<00:00,  4.10it/s]